{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "84d8c7a0-11ce-46b3-aeb8-9829aa03ac79",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Roman Ramirez, rr8rk@virignia.edu\n",
    "# Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "7c80b556-077b-4cba-93ac-4c59fe1ea43c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# IMPORTING MODULES\n",
    "\n",
    "import pprint\n",
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "from py2neo import Node\n",
    "from py2neo import Relationship\n",
    "from py2neo import NodeMatcher"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e6d17190-79fc-45cd-8f13-a1cfa1c1be0a",
   "metadata": {},
   "source": [
    "## SETUP"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "a45f699b-3885-45ee-86c7-1c7aee9e964d",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "077a8951-cca1-464c-a389-10017688c540",
   "metadata": {},
   "outputs": [],
   "source": [
    "STUDENT_DATABASE = 'student_database'\n",
    "SUBJECT_DATABASE = 'subject_database'\n",
    "FACULTY_DATABASE = 'faculty_database'\n",
    "HOUSE_DATABASE = 'house_database'\n",
    "\n",
    "# defining node types\n",
    "STUDENT = 'Student'\n",
    "HOUSE = 'House'\n",
    "YEAR = 'Year'\n",
    "COLOR = 'Color'\n",
    "CLASS = 'Class'\n",
    "FACULTY = 'Faculty'\n",
    "SUBJECT = 'Subject'\n",
    "SCHOOL = 'School'\n",
    "\n",
    "# reading all sheets\n",
    "student_df = pd.read_excel('database_draft.xlsx', sheet_name=STUDENT_DATABASE)\n",
    "subject_df = pd.read_excel('database_draft.xlsx', sheet_name=SUBJECT_DATABASE)\n",
    "faculty_df = pd.read_excel('database_draft.xlsx', sheet_name=FACULTY_DATABASE)\n",
    "house_df = pd.read_excel('database_draft.xlsx', sheet_name=HOUSE_DATABASE)\n",
    "\n",
    "# getting all unique values\n",
    "student_uniques = dict()\n",
    "subject_uniques = dict()\n",
    "faculty_uniques = dict()\n",
    "house_uniques = dict()\n",
    "\n",
    "for col in student_df.columns:\n",
    "    student_uniques[col] = set(student_df[col])\n",
    "for col in subject_df.columns:\n",
    "    subject_uniques[col] = set(subject_df[col])\n",
    "for col in faculty_df.columns:\n",
    "    faculty_uniques[col] = set(faculty_df[col])\n",
    "for col in house_df.columns:\n",
    "    house_uniques[col] = set(house_df[col])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e10ef08e-8dcc-400a-afca-e63205af7b2f",
   "metadata": {},
   "source": [
    "## Creating and adding to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "86492c62-756a-4650-a0d2-ebcddb9b26e2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_id</th>\n",
       "      <th>student_fname</th>\n",
       "      <th>student_lname</th>\n",
       "      <th>school</th>\n",
       "      <th>house_id</th>\n",
       "      <th>role</th>\n",
       "      <th>year</th>\n",
       "      <th>fav_color</th>\n",
       "      <th>fav_class_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>hp215</td>\n",
       "      <td>harry</td>\n",
       "      <td>potter</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>0.0</td>\n",
       "      <td>student</td>\n",
       "      <td>4.0</td>\n",
       "      <td>red</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>rw912</td>\n",
       "      <td>ron</td>\n",
       "      <td>weasley</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>0.0</td>\n",
       "      <td>student</td>\n",
       "      <td>4.0</td>\n",
       "      <td>blue</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>hg017</td>\n",
       "      <td>hermione</td>\n",
       "      <td>granger</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>0.0</td>\n",
       "      <td>student</td>\n",
       "      <td>4.0</td>\n",
       "      <td>orange</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>dm120</td>\n",
       "      <td>draco</td>\n",
       "      <td>malfoy</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>3.0</td>\n",
       "      <td>student</td>\n",
       "      <td>4.0</td>\n",
       "      <td>purple</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>nl742</td>\n",
       "      <td>neville</td>\n",
       "      <td>longbottom</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>0.0</td>\n",
       "      <td>student</td>\n",
       "      <td>4.0</td>\n",
       "      <td>red</td>\n",
       "      <td>4.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     _id student_fname student_lname    school  house_id     role  year  \\\n",
       "0  hp215         harry        potter  hogwarts       0.0  student   4.0   \n",
       "1  rw912           ron       weasley  hogwarts       0.0  student   4.0   \n",
       "2  hg017      hermione       granger  hogwarts       0.0  student   4.0   \n",
       "3  dm120         draco        malfoy  hogwarts       3.0  student   4.0   \n",
       "4  nl742       neville    longbottom  hogwarts       0.0  student   4.0   \n",
       "\n",
       "  fav_color  fav_class_id  \n",
       "0       red           0.0  \n",
       "1      blue           0.0  \n",
       "2    orange           1.0  \n",
       "3    purple           5.0  \n",
       "4       red           4.0  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "student_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "c3856e5b-fb0e-46d9-a74a-d5adbf98adc4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>faculty_id</th>\n",
       "      <th>faculty_fname</th>\n",
       "      <th>faculty_lname</th>\n",
       "      <th>subject_id</th>\n",
       "      <th>school</th>\n",
       "      <th>house_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>111.0</td>\n",
       "      <td>minerva</td>\n",
       "      <td>mcgonagall</td>\n",
       "      <td>4.0</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>222.0</td>\n",
       "      <td>severus</td>\n",
       "      <td>snape</td>\n",
       "      <td>5.0</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>333.0</td>\n",
       "      <td>filius</td>\n",
       "      <td>flitwick</td>\n",
       "      <td>13.0</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>444.0</td>\n",
       "      <td>pomona</td>\n",
       "      <td>sprout</td>\n",
       "      <td>2.0</td>\n",
       "      <td>hogwarts</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>555.0</td>\n",
       "      <td>sophie</td>\n",
       "      <td>lebovitz</td>\n",
       "      <td>10.0</td>\n",
       "      <td>beauxbatons</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   faculty_id faculty_fname faculty_lname  subject_id       school  house_id\n",
       "0       111.0       minerva    mcgonagall         4.0     hogwarts       0.0\n",
       "1       222.0       severus         snape         5.0     hogwarts       3.0\n",
       "2       333.0        filius      flitwick        13.0     hogwarts       1.0\n",
       "3       444.0        pomona        sprout         2.0     hogwarts       2.0\n",
       "4       555.0        sophie      lebovitz        10.0  beauxbatons       6.0"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "faculty_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "931df7ca-4388-4ded-b1e2-564edf831166",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>house_id</th>\n",
       "      <th>name</th>\n",
       "      <th>color_1</th>\n",
       "      <th>color_2</th>\n",
       "      <th>value_1</th>\n",
       "      <th>value_2</th>\n",
       "      <th>value_3</th>\n",
       "      <th>value_4</th>\n",
       "      <th>house_points</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>gryffindor</td>\n",
       "      <td>red</td>\n",
       "      <td>gold</td>\n",
       "      <td>courage</td>\n",
       "      <td>bravery</td>\n",
       "      <td>nerve</td>\n",
       "      <td>chivalry</td>\n",
       "      <td>1170.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>ravenclaw</td>\n",
       "      <td>blue</td>\n",
       "      <td>bronze</td>\n",
       "      <td>hard work</td>\n",
       "      <td>patience</td>\n",
       "      <td>justice</td>\n",
       "      <td>loyalty</td>\n",
       "      <td>1350.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>hufflepuff</td>\n",
       "      <td>yellow</td>\n",
       "      <td>black</td>\n",
       "      <td>intelligence</td>\n",
       "      <td>learning</td>\n",
       "      <td>wisdom</td>\n",
       "      <td>wit</td>\n",
       "      <td>1240.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>slytherin</td>\n",
       "      <td>green</td>\n",
       "      <td>silver</td>\n",
       "      <td>ambition</td>\n",
       "      <td>cunning</td>\n",
       "      <td>leadership</td>\n",
       "      <td>resourcefulness</td>\n",
       "      <td>1436.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>ombrelune</td>\n",
       "      <td>gray</td>\n",
       "      <td>NaN</td>\n",
       "      <td>cunning</td>\n",
       "      <td>logic</td>\n",
       "      <td>ambition</td>\n",
       "      <td>curiosity</td>\n",
       "      <td>1334.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   house_id        name color_1 color_2       value_1   value_2     value_3  \\\n",
       "0         0  gryffindor     red    gold       courage   bravery       nerve   \n",
       "1         1   ravenclaw    blue  bronze     hard work  patience     justice   \n",
       "2         2  hufflepuff  yellow   black  intelligence  learning      wisdom   \n",
       "3         3   slytherin   green  silver      ambition   cunning  leadership   \n",
       "4         4   ombrelune    gray     NaN       cunning     logic    ambition   \n",
       "\n",
       "           value_4  house_points  \n",
       "0         chivalry        1170.0  \n",
       "1          loyalty        1350.0  \n",
       "2              wit        1240.0  \n",
       "3  resourcefulness        1436.0  \n",
       "4        curiosity        1334.0  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "house_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "9c9dc47b-f8e7-46b1-b70a-d9068e02e602",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>class_id</th>\n",
       "      <th>class_name</th>\n",
       "      <th>capacity</th>\n",
       "      <th>location</th>\n",
       "      <th>faculty_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>defense</td>\n",
       "      <td>20.0</td>\n",
       "      <td>3C</td>\n",
       "      <td>222.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1.0</td>\n",
       "      <td>arithmancy</td>\n",
       "      <td>15.0</td>\n",
       "      <td>turris_magnus</td>\n",
       "      <td>111.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2.0</td>\n",
       "      <td>herbology</td>\n",
       "      <td>10.0</td>\n",
       "      <td>greenhouse</td>\n",
       "      <td>333.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3.0</td>\n",
       "      <td>flying</td>\n",
       "      <td>20.0</td>\n",
       "      <td>field</td>\n",
       "      <td>444.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4.0</td>\n",
       "      <td>transfigurations</td>\n",
       "      <td>60.0</td>\n",
       "      <td>1B</td>\n",
       "      <td>111.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   class_id        class_name  capacity       location  faculty_id\n",
       "0       0.0           defense      20.0             3C       222.0\n",
       "1       1.0        arithmancy      15.0  turris_magnus       111.0\n",
       "2       2.0        herbology       10.0     greenhouse       333.0\n",
       "3       3.0            flying      20.0          field       444.0\n",
       "4       4.0  transfigurations      60.0             1B       111.0"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "subject_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "4b809a4e-c66d-4738-bbdd-7c9062cd3ff8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# creating nodes\n",
    "\n",
    "graph.run(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "student_df.head()\n",
    "\n",
    "### LARGE NODES\n",
    "\n",
    "# making all student nodes\n",
    "nodes_student = dict()\n",
    "for i in range(len(student_df)):\n",
    "    row = student_df.iloc[i]\n",
    "    local_node = Node(\n",
    "        STUDENT,\n",
    "        _id=row['_id'],\n",
    "        fname=row['student_fname'],\n",
    "        lname=row['student_lname'],\n",
    "        name=f\"{row['student_fname'].capitalize()} {row['student_lname'].capitalize()}\"\n",
    "    )\n",
    "    nodes_student.update({row['_id']: local_node})\n",
    "    graph.create(local_node)\n",
    "    \n",
    "# making all faculty nodes\n",
    "nodes_faculty = dict()\n",
    "for i in range(len(faculty_df)):\n",
    "    row = faculty_df.iloc[i]\n",
    "    local_node = Node(\n",
    "        FACULTY,\n",
    "        _id=int(row['faculty_id']),\n",
    "        fname=row['faculty_fname'],\n",
    "        lname=row['faculty_lname'],\n",
    "        name=f\"{row['faculty_fname'].capitalize()} {row['faculty_lname'].capitalize()}\",\n",
    "    )\n",
    "    nodes_faculty.update({row['faculty_id']: local_node})\n",
    "    graph.create(local_node)\n",
    "    \n",
    "# making all subject nodes\n",
    "nodes_subject = dict()\n",
    "for i in range(len(subject_df)):\n",
    "    row = subject_df.iloc[i]\n",
    "    local_node = Node(\n",
    "        SUBJECT,\n",
    "        _id=int(row['class_id']),\n",
    "        name=row['class_name'],\n",
    "        capacity=int(row['capacity']),\n",
    "        location=row['location']\n",
    "    )\n",
    "    nodes_subject.update({row['class_id']: local_node})\n",
    "    graph.create(local_node)\n",
    "    \n",
    "# making all house nodes\n",
    "nodes_house = dict()\n",
    "for i in range(len(house_df)):\n",
    "    row = house_df.iloc[i]\n",
    "    local_node = Node(\n",
    "        HOUSE,\n",
    "        house_id=int(row['house_id']),\n",
    "        name=row['name'],\n",
    "        color_1=row['color_1'],\n",
    "        color_2=row['color_2'],\n",
    "        value_1=row['value_1'],\n",
    "        value_2=row['value_2'],\n",
    "        value_3=row['value_3'],\n",
    "        value_4=row['value_4'],\n",
    "        house_points=int(row['house_points'])\n",
    "    )\n",
    "    nodes_house.update({row['house_id']: local_node})\n",
    "    graph.create(local_node)\n",
    "    \n",
    "### SMALL ONES\n",
    "\n",
    "# making all schools (students)\n",
    "nodes_school = dict()\n",
    "for school in student_uniques['school']:\n",
    "    local_node = Node(\n",
    "        SCHOOL,\n",
    "        school=school\n",
    "    )\n",
    "    graph.create(local_node)\n",
    "    nodes_school.update({school: local_node})\n",
    "    \n",
    "# making all years (students)\n",
    "nodes_year = dict()\n",
    "for year in student_uniques['year']:\n",
    "    local_node = Node(\n",
    "        YEAR,\n",
    "        year=f\"Year {int(year)}\"\n",
    "    )\n",
    "    graph.create(local_node)\n",
    "    nodes_year.update({year: local_node})\n",
    "\n",
    "# making all color nodes (students)\n",
    "nodes_color = dict()\n",
    "for color in student_uniques['fav_color']:\n",
    "    local_node = Node(\n",
    "        COLOR,\n",
    "        fav_color=color\n",
    "    )\n",
    "    graph.create(local_node)\n",
    "    nodes_color.update({color: local_node})\n",
    "    \n",
    "# creating relationships\n",
    "\n",
    "# defining relationships\n",
    "\n",
    "student2subject = Relationship.type(\"LIKES_THE_SUBJECT\")\n",
    "student2house   = Relationship.type(\"BELONGS_TO\")\n",
    "student2school  = Relationship.type(\"ATTENDS\")\n",
    "student2year    = Relationship.type(\"IS_YEAR\")\n",
    "student2color   = Relationship.type(\"LIKES_THE_COLOR\")\n",
    "\n",
    "faculty2subject = Relationship.type(\"TEACHES\")\n",
    "faculty2house   = Relationship.type(\"BELONGS_TO\")\n",
    "faculty2school  = Relationship.type(\"TEACHES_AT\")\n",
    "\n",
    "def assign_all_relationships(d1, n1, d2, n2, r):\n",
    "    for (a, b) in zip(d1, d2):\n",
    "        graph.create(r(n1[a], n2[b]))\n",
    "\n",
    "assign_all_relationships(student_df['_id'], nodes_student, student_df['fav_class_id'], nodes_subject, student2subject)\n",
    "assign_all_relationships(student_df['_id'], nodes_student, student_df['house_id'], nodes_house, student2house)\n",
    "assign_all_relationships(student_df['_id'], nodes_student, student_df['school'], nodes_school, student2school)\n",
    "assign_all_relationships(student_df['_id'], nodes_student, student_df['year'], nodes_year, student2year)\n",
    "assign_all_relationships(student_df['_id'], nodes_student, student_df['fav_color'], nodes_color, student2color)\n",
    "\n",
    "assign_all_relationships(faculty_df['faculty_id'], nodes_faculty, faculty_df['subject_id'], nodes_subject, faculty2subject)\n",
    "assign_all_relationships(faculty_df['faculty_id'], nodes_faculty, faculty_df['house_id'], nodes_house, faculty2house)\n",
    "assign_all_relationships(faculty_df['faculty_id'], nodes_faculty, faculty_df['school'], nodes_school, faculty2school)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7d3e0e04-ba18-4484-b3d3-64108ee52a46",
   "metadata": {},
   "source": [
    "# QUERIES"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4fcb5ed6-eb82-4345-8ea8-fbfd52a1e648",
   "metadata": {},
   "outputs": [],
   "source": [
    "matcher = NodeMatcher(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "c92a8af7-2890-43fb-856c-c9dfe1dd6fc3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>n</th></tr><tr><td style=\"text-align:left\">(_37:Student {_id: &#039;hp215&#039;, fname: &#039;harry&#039;, lname: &#039;potter&#039;, name: &#039;Harry Potter&#039;})</td></tr><tr><td style=\"text-align:left\">(_38:Student {_id: &#039;rw912&#039;, fname: &#039;ron&#039;, lname: &#039;weasley&#039;, name: &#039;Ron Weasley&#039;})</td></tr><tr><td style=\"text-align:left\">(_39:Student {_id: &#039;hg017&#039;, fname: &#039;hermione&#039;, lname: &#039;granger&#039;, name: &#039;Hermione Granger&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " n                                                                                           \n",
       "---------------------------------------------------------------------------------------------\n",
       " (_37:Student {_id: 'hp215', fname: 'harry', lname: 'potter', name: 'Harry Potter'})         \n",
       " (_38:Student {_id: 'rw912', fname: 'ron', lname: 'weasley', name: 'Ron Weasley'})           \n",
       " (_39:Student {_id: 'hg017', fname: 'hermione', lname: 'granger', name: 'Hermione Granger'}) "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "matcher.match(\"Student\", name=\"Hannah Abbott\").all()\n",
    "graph.run(\"MATCH (n: Student) RETURN n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "f4f11cc5-a21c-4c48-847a-5dea499b0831",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " vulpelara_students \n",
      "--------------------\n",
      "                  0 \n",
      "\n",
      " bellefeuille_students \n",
      "-----------------------\n",
      "                     1 \n",
      "\n",
      " ombrelune_students \n",
      "--------------------\n",
      "                  1 \n",
      "\n",
      " soscrofa_students \n",
      "-------------------\n",
      "                 1 \n",
      "\n",
      " hufflepuff_students \n",
      "---------------------\n",
      "                   5 \n",
      "\n",
      " ravenclaw_students \n",
      "--------------------\n",
      "                  7 \n",
      "\n",
      " slytherin_students \n",
      "--------------------\n",
      "                  8 \n",
      "\n",
      " ucilena_students \n",
      "------------------\n",
      "                0 \n",
      "\n",
      " gryffindor_students \n",
      "---------------------\n",
      "                  21 \n",
      "\n",
      " papillonlisse_students \n",
      "------------------------\n",
      "                      1 \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# number of students in each house\n",
    "for house in house_uniques['name']:\n",
    "    local_query = \"MATCH (n: House {name: \\\"%s\\\"})<--(s: Student) RETURN count(s) as %s_students\" % (house, house)\n",
    "    local_query_result = graph.run(local_query)\n",
    "    print(local_query_result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "id": "162f236a-f3eb-442d-98b3-df77a065ef1d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a.name': 'Oliver Wood', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Ginny Weasley', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'George Weasley', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Fred Weasley', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Romilda Vane', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Dean Thomas', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Alicia Spinnet', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Parvati Patil', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Cormac Mclaggen', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Eloise Midgen', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Lee Jordan', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Angelina Johnson', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Seamus Finnigan', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Dennis Creevey', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Colin Creevey', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Lavender Brown', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Katie Bell', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Neville Longbottom', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Hermione Granger', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Ron Weasley', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Harry Potter', 'b.name': 'gryffindor'},\n",
       " {'a.name': 'Padma Patil', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Anthony Goldstein', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Marietta Edgecombe', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Penelope Clearwater', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Terry Boot', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Tatev Gomtsyan', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Roman Ramirez', 'b.name': 'ravenclaw'},\n",
       " {'a.name': 'Ernie Macmillan', 'b.name': 'hufflepuff'},\n",
       " {'a.name': 'Justin Finch-fletchley', 'b.name': 'hufflepuff'},\n",
       " {'a.name': 'Cedric Diggory', 'b.name': 'hufflepuff'},\n",
       " {'a.name': 'Susan Bones', 'b.name': 'hufflepuff'},\n",
       " {'a.name': 'Hannah Abbott', 'b.name': 'hufflepuff'},\n",
       " {'a.name': 'Blaise Zabini', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Zacharias Smith', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Pansy Parkinson', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Theodore Nott', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Gregory Goyle', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Vincent Crabbe', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Millicent Bulstrode', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Draco Malfoy', 'b.name': 'slytherin'},\n",
       " {'a.name': 'Fleur Delacour', 'b.name': 'ombrelune'},\n",
       " {'a.name': 'Aurelie Dumont', 'b.name': 'bellefeuille'},\n",
       " {'a.name': 'Gabrielle Delacour', 'b.name': 'papillonlisse'},\n",
       " {'a.name': 'Viktor Krum', 'b.name': 'soscrofa'}]"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# number of students in each house\n",
    "local_query = '''\n",
    "MATCH p=(a:Student)-[]-(b:House)\n",
    "RETURN DISTINCT a.name, b.name\n",
    "'''\n",
    "local_query_result = graph.run(local_query)\n",
    "local_query_result.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "f686368f-4d41-47d9-bfa6-e189f9ad88ec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Oliver Wood',\n",
       " 'Ginny Weasley',\n",
       " 'Fred Weasley',\n",
       " 'Theodore Nott',\n",
       " 'Gregory Goyle',\n",
       " 'Vincent Crabbe',\n",
       " 'Hannah Abbott',\n",
       " 'Ron Weasley']"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# who likes the same subject as harry potter?\n",
    "local_query = 'MATCH (hp:Student {_id: \"hp215\"})-[:LIKES_THE_SUBJECT]->(m)<-[:LIKES_THE_SUBJECT]-(classmate:Student) RETURN DISTINCT classmate.name as likes_the_same_subject_as_hp'\n",
    "# local_query = 'MATCH p=(hp:Student {_id: \"hp215\"})-[:LIKES_THE_SUBJECT]->(m)<-[:LIKES_THE_SUBJECT]-(classmate:Student) RETURN p'\n",
    "local_query_result = graph.run(local_query)\n",
    "[x['likes_the_same_subject_as_hp'] for x in local_query_result.data()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "b0637dff-75b7-4abc-987b-c61ff5345cee",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>classmates</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Theodore Nott</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gregory Goyle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Vincent Crabbe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Hannah Abbott</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Ron Weasley</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       classmates\n",
       "0   Theodore Nott\n",
       "1   Gregory Goyle\n",
       "2  Vincent Crabbe\n",
       "3   Hannah Abbott\n",
       "4     Ron Weasley"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# who were harry potter's classmates?\n",
    "local_query = 'MATCH (hp:Student {_id: \"hp215\"})-[:LIKES_THE_SUBJECT]->(m)<-[:LIKES_THE_SUBJECT]-(classmate:Student)-[:IS_YEAR]->(d:Year {year: \"Year 4\"}) RETURN DISTINCT classmate.name as classmates'\n",
    "local_query_result = graph.run(local_query)\n",
    "local_query_result.to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "582217c6-c70b-4ec1-9e9f-dad5a29c603b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(Hermione Granger)-[:IS_YEAR {}]->(_123)\n",
      "(Parvati Patil)-[:IS_YEAR {}]->(_123)\n",
      "(Parvati Patil)-[:LIKES_THE_COLOR {}]->(_128)\n",
      "(Gabrielle Delacour)-[:LIKES_THE_COLOR {}]->(_128)\n",
      "(Gabrielle Delacour)-[:ATTENDS {}]->(_117)\n",
      "(Sophie Lebovitz)-[:TEACHES_AT {}]->(_117)\n"
     ]
    }
   ],
   "source": [
    "# closest relationship between hermione granger and sophie lebovitz\n",
    "local_query = '''\n",
    "MATCH p=shortestPath(\n",
    "(a:Student {name:\"Hermione Granger\"})-[*]-(b:Faculty {name:\"Sophie Lebovitz\"})\n",
    ")\n",
    "RETURN p\n",
    "'''\n",
    "local_query_result = graph.run(local_query)\n",
    "for point in local_query_result.to_subgraph():\n",
    "    print(point)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5531299c-cc2e-4f3a-ac71-b37d85dc2056",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a._id': 12, 'c.school': 'beauxbatons', 'a.name': 'etiquette'},\n",
       " {'a._id': 11, 'c.school': 'beauxbatons', 'a.name': 'literature'},\n",
       " {'a._id': 10, 'c.school': 'beauxbatons', 'a.name': 'culinary_arts'},\n",
       " {'a._id': 9, 'c.school': 'durmstrang', 'a.name': 'rare_languages'},\n",
       " {'a._id': 0, 'c.school': 'durmstrang', 'a.name': 'defense'},\n",
       " {'a._id': 8, 'c.school': 'durmstrang', 'a.name': 'spellworks'},\n",
       " {'a._id': 2, 'c.school': 'hogwarts', 'a.name': 'herbology '},\n",
       " {'a._id': 13, 'c.school': 'hogwarts', 'a.name': 'charms'},\n",
       " {'a._id': 5, 'c.school': 'hogwarts', 'a.name': 'potions'},\n",
       " {'a._id': 4, 'c.school': 'hogwarts', 'a.name': 'transfigurations'},\n",
       " {'a._id': 0, 'c.school': 'hogwarts', 'a.name': 'defense'},\n",
       " {'a._id': 3, 'c.school': 'hogwarts', 'a.name': 'flying'},\n",
       " {'a._id': 7, 'c.school': 'hogwarts', 'a.name': 'quidditch'},\n",
       " {'a._id': 6, 'c.school': 'hogwarts', 'a.name': 'lunch'},\n",
       " {'a._id': 1, 'c.school': 'hogwarts', 'a.name': 'arithmancy'}]"
      ]
     },
     "execution_count": 127,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# number of classes in each school\n",
    "local_query = '''\n",
    "MATCH p=(a:Subject)-[]-()-[]-(c:School)\n",
    "RETURN DISTINCT a._id, c.school, a.name \n",
    "'''\n",
    "local_query_result = graph.run(local_query)\n",
    "local_query_result.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "id": "d9234c91-b44f-43ea-b526-62185308bc2a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Blaise Zabini'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Romilda Vane'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Dean Thomas'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Parvati Patil'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Lee Jordan'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Seamus Finnigan'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Cedric Diggory'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Susan Bones'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Katie Bell'},\n",
      " {'a.name': 'Minerva Mcgonagall',\n",
      "  'c.name': 'transfigurations',\n",
      "  'e.name': 'Neville Longbottom'},\n",
      " {'a.name': 'Severus Snape', 'c.name': 'potions', 'e.name': 'Pansy Parkinson'},\n",
      " {'a.name': 'Severus Snape',\n",
      "  'c.name': 'potions',\n",
      "  'e.name': 'Justin Finch-fletchley'},\n",
      " {'a.name': 'Severus Snape',\n",
      "  'c.name': 'potions',\n",
      "  'e.name': 'Marietta Edgecombe'},\n",
      " {'a.name': 'Severus Snape',\n",
      "  'c.name': 'potions',\n",
      "  'e.name': 'Penelope Clearwater'},\n",
      " {'a.name': 'Severus Snape', 'c.name': 'potions', 'e.name': 'Draco Malfoy'},\n",
      " {'a.name': 'Pomona Sprout', 'c.name': 'herbology ', 'e.name': 'Padma Patil'},\n",
      " {'a.name': 'Pomona Sprout',\n",
      "  'c.name': 'herbology ',\n",
      "  'e.name': 'Tatev Gomtsyan'},\n",
      " {'a.name': 'Sophie Lebovitz',\n",
      "  'c.name': 'culinary_arts',\n",
      "  'e.name': 'Fleur Delacour'},\n",
      " {'a.name': 'Marie-anne Briony',\n",
      "  'c.name': 'literature',\n",
      "  'e.name': 'Gabrielle Delacour'},\n",
      " {'a.name': 'Decima Darling',\n",
      "  'c.name': 'etiquette',\n",
      "  'e.name': 'Aurelie Dumont'},\n",
      " {'a.name': 'Atash Hendurabi', 'c.name': 'spellworks', 'e.name': 'Viktor Krum'},\n",
      " {'a.name': 'Auberon Eisenberg', 'c.name': 'defense', 'e.name': 'Oliver Wood'},\n",
      " {'a.name': 'Auberon Eisenberg',\n",
      "  'c.name': 'defense',\n",
      "  'e.name': 'Ginny Weasley'},\n",
      " {'a.name': 'Auberon Eisenberg', 'c.name': 'defense', 'e.name': 'Fred Weasley'},\n",
      " {'a.name': 'Auberon Eisenberg',\n",
      "  'c.name': 'defense',\n",
      "  'e.name': 'Theodore Nott'},\n",
      " {'a.name': 'Auberon Eisenberg',\n",
      "  'c.name': 'defense',\n",
      "  'e.name': 'Gregory Goyle'},\n",
      " {'a.name': 'Auberon Eisenberg',\n",
      "  'c.name': 'defense',\n",
      "  'e.name': 'Vincent Crabbe'},\n",
      " {'a.name': 'Auberon Eisenberg',\n",
      "  'c.name': 'defense',\n",
      "  'e.name': 'Hannah Abbott'},\n",
      " {'a.name': 'Auberon Eisenberg', 'c.name': 'defense', 'e.name': 'Ron Weasley'},\n",
      " {'a.name': 'Auberon Eisenberg', 'c.name': 'defense', 'e.name': 'Harry Potter'}]\n"
     ]
    }
   ],
   "source": [
    "# showing the students' favorite classes and also showing who its taught by\n",
    "local_query = '''\n",
    "MATCH p=(a:Faculty)-[b:TEACHES]-(c:Subject)-[d:LIKES_THE_SUBJECT]-(e:Student)\n",
    "RETURN DISTINCT e.name, c.name, a.name\n",
    "'''\n",
    "local_query_result = graph.run(local_query)\n",
    "pprint.pprint(local_query_result.data())\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
